Revit 2024 API
MultiReferenceAnnotationOptions.SetAdditionalReferencesToDimension Method
 Sets the additional references which the dimension will witness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public void SetAdditionalReferencesToDimension(
	IList<Reference> referencesToDimension
)
Visual Basic
Public Sub SetAdditionalReferencesToDimension ( _
	referencesToDimension As IList(Of Reference) _
)
Visual C++
public:
void SetAdditionalReferencesToDimension(
	IList<Reference^>^ referencesToDimension
)
Parameters
referencesToDimension
Type: System.Collections.Generic.IList<Reference>
 The additional references which the dimension will witness.
Remarks
 The additional references to dimension cannot come from the same category as the MultiReferenceAnnotationType's reference category.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Some references come from elements which directly match the reference category required by the MultiReferenceAnnotationType. For those elements please use SetElementsToDimension.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace